"""
Напишите программу, которая выводит слова «Python is awesome!» (без кавычек) 10 раз.

Формат входных данных

Формат выходных данных
Программа должна вывести 10 раз текст «Python is awesome!», каждый на отдельной строке.

Sample Input:

Sample Output:

Python is awesome!
Python is awesome!
Python is awesome!
Python is awesome!
Python is awesome!
Python is awesome!
Python is awesome!
Python is awesome!
Python is awesome!
Python is awesome!
"""

for i in range(10):
    print('Python is awesome!')
