"""
Две старушки идут навстречу друг другу с постоянными скоростями V_1 и V_2 км/ч.
Определите, через какое время старушки встретятся, если расстояние между ними равно S км.
"""

S = float(input())
v1 = float(input())
v2 = float(input())
print(S / (v1 + v2))
