"""
Напишите программу, которая выводит указанный треугольник, состоящий из звездочек (*).

Sample Input:

Sample Output:

*
**
***
****
*****
******
*******
"""

print('*')
print('**')
print('***')
print('****')
print('*****')
print('******')
print('*******')
