"""
Напишите программу, которая считывает три строки по очереди, а затем выводит их в обратной последовательности, 
каждую на отдельной строчке. 

Формат входных данных
На вход программе подается три строки, каждая на отдельной строке.

Формат выходных данных
Программа должна вывести введенные строки в обратной последовательности, каждую на отдельной строке.

Примечание. Используйте 3 переменные для сохранения введённых строк текста.

Sample Input 1:

Hello
it's
me
Sample Output 1:

me
it's
Hello
"""

a = input()
b = input()
c = input()

print(c)
print(b)
print(a)
