"""
Напишите программу, которая определяет наименьшее из четырёх чисел.

Формат входных данных
На вход программе подаётся четыре целых числа.

Формат выходных данных
Программа должна вывести наименьшее из четырёх чисел.

Sample Input 1:

1
2
3
4
Sample Output 1:

1
"""

print(min(int(input()), int(input()), int(input()), int(input())))
