"""
Напишите программу, которая считывает три целых числа и выводит на экран их сумму. Каждое число записано в
отдельной строке.

Формат входных данных
На вход программе подаётся три целых числа, каждое на отдельной строке.

Формат выходных данных
Программа должна вывести сумму введенных чисел.

Sample Input 1:

9
11
2
Sample Output 1:

22
"""
print(int(input()) + int(input()) + int(input()))
