/* Задание
Занесите новую строку в таблицу book (текстовые значения (тип VARCHAR) заключать либо в двойные, либо в одинарные кавычки):

Результат:

Affected rows: 1
Query result:
+---------+--------------------+---------------+--------+--------+
| book_id | title              | author        | price  | amount |
+---------+--------------------+---------------+--------+--------+
| 1       | Мастер и Маргарита | Булгаков М.А. | 670.99 | 3      |
+---------+--------------------+---------------+--------+--------+
*/

INSERT INTO book (title, author, price, amount) 
VALUES ('Мастер и Маргарита', 'Булгаков М.А.', '670.99', 3);

SELECT * FROM book;


-- Занесите три последние записи в таблицу book,  первая запись уже добавлена на предыдущем шаге:
/* Результат : 

Affected rows: 1
Affected rows: 1
Affected rows: 1
Query result:
+---------+--------------------+------------------+--------+--------+
| book_id | title              | author           | price  | amount |
+---------+--------------------+------------------+--------+--------+
| 1       | Мастер и Маргарита | Булгаков М.А.    | 670.99 | 3      |
| 2       | Белая гвардия      | Булгаков М.А.    | 540.50 | 5      |
| 3       | Идиот              | Достоевский Ф.М. | 460.00 | 10     |
| 4       | Братья Карамазовы  | Достоевский Ф.М. | 799.01 | 2      |
+---------+--------------------+------------------+--------+--------+
*/

INSERT INTO book (book_id, title, author, price, amount) 
VALUES (2, 'Белая гвардия', 'Булгаков М.А.', '540.50', 5);
        
INSERT INTO book (book_id, title, author, price, amount) 
VALUES (3, 'Идиот', 'Достоевский Ф.М.', '460.00', 10);

INSERT INTO book (book_id, title, author, price, amount) 
VALUES (4, 'Братья Карамазовы', 'Достоевский Ф.М.', '799.01', 2);

SELECT * FROM book;
