"""
Напишите программу, которая выводит на экран текст «I***like***Python» (без кавычек).

Примечание. Используйте необязательный параметр sep.

Sample Input:

Sample Output:

I***like***Python
"""

print('I', 'like', 'Python', sep='***')
