# Напишите программу, которая выводит на экран текст «Здравствуй, мир!» (без кавычек).

print('Здравствуй, мир!')
